#!/usr/bin/env python
# coding: utf-8

# In[62]:


# Action2: 统计全班的成绩
# 班里有5名同学，现在需要你用Python来统计下这些人在语文、英语、数学中的平均成绩、最小成绩、最大成绩、方差、标准差。
# 然后把这些人的总成绩排序，得出名次进行成绩输出（可以用numpy或pandas）

# 导入pandas
       
from pandas import Series, DataFrame
data = {'语文': [66, 95, 98, 90,80], '数学': [65, 76, 86, 88, 90], '英语': [30, 98, 88, 77, 90]}
df = DataFrame(data,index=['张飞','关羽','刘备','典韦','许褚'],columns=['语文','数学','英语'])
df1 = DataFrame(data,index=['张飞','关羽','刘备','典韦','许褚'],columns=['语文','数学','英语','总计'])

df1['总计']=df1.sum(axis=1)
print('平均分\n',df.mean())
print ("============================================")
print('最小成绩\n',df.min())
print ("============================================")
print('最大成绩\n',df.max())
print ("============================================")
print('方差\n',df.var())
print ("============================================")
print('标准差\n',df.std())
print ("============================================")
#输出按总成绩倒序排名
print ('总成绩排名如下：')
print (df1.sort_values('总计',ascending=False))





# In[ ]:




